{
    "title": "Théo Dhuiege - My Page",
    "header-title": "Welcome to Théo Dhuiege's page",
    "tab-home": "Home",
    "tab-competences": "Skills",
    "tab-cv": "CV",
    "tab-projets": "My Projects",
    "tab-videos": "Videos",
    "tab-contact": "Contact",
    "tab-perso": "Personal",
    "home-title": "Home",
    "home-desc1": "Student in the first year of Master in Complex Systems Engineering",
    "home-desc2": "I am passionate about technology and currently studying in this field.",
    "home-desc3": "This page shows my academic and professional background as well as some of my projects completed during my studies and personally.",
    "competences-title1":"Computer Science Skills",
    "competences-title2":"Electronics Skills",
    "competences-title3":"Automation and Control Skills",
    "competences-title4":"Additional Skills",
    "competences-desc1":"Languages: C, Java, VBA|VBNet, and VHDL.",
    "competences-desc2":"Use of various programming software: CCS C, PlatformIO, Visual Studio, PSoC Creator.",
    "competences-desc3":"Development of projects on boards and microcontrollers such as Arduino, PIC C, and Raspberry Pi.",
    "competences-desc4":"Research and development of electronic schematics, design and testing of these schematics.",
    "competences-desc5":"Use of software for design and research assistance: MatLab, Proteus suite.",
    "competences-desc6":"Implementation of control systems with regulation parameters in thermal, pneumatic, and mechanical systems.",
    "competences-desc7":"Programming Siemens and Schneider PLCs using their dedicated software: TIA Portal and Unity Pro. Programming in LADDER and GRAFCET.",
    "competences-desc8":"Programming in Microsoft Excel using VBA.",
    "competences-desc9":"Project planning and reflection using dedicated tools such as the Gantt method.",
    "competences-desc10":"Maintenance research methods: Pareto, PDCA, or Ishikawa diagram.",
    "cv-title":"History",
    "cv-desc1":"September 2019 - July 2022: general baccalaureate at Lycée Léonard de Vinci in Soissons.",
    "cv-desc2":"Chosen specialties: mathematics and engineering sciences",
    "cv-desc3":"Final year option: advanced mathematics.",
    "cv-desc4":"Baccalaureate obtained in June 2022 with honors.",
    "cv-desc5":"September 2022 - July 2025: BUT in Electrical Engineering and Industrial Computing.",
    "cv-desc6":"Specialty: Electronics and Embedded Systems",
    "cv-desc7":"April - June 2024: internship as part of my BUT program.",
    "cv-desc8":"Research, development, and presentation during a competition of a hand communication tool.",
    "cv-desc9":"March - June 2025: internship as part of my BUT program.",
    "cv-desc10":"Design, construction, and presentation during a competition of a learning tool in various cognitive fields.",
    "projets-title1":"Student IT Project",
    "projets-title2":"Second Year Internship Project",
    "projets-title3":"Third Year Internship Project",
    "projets-desc1":"Development of a train ticket management system using Microsoft Excel and VBA.",
    "projets-desc2":"Features: Route management, ticket purchase, tariff customization, and statistics consultation.",
    "projets-desc3":"You can read the manual of this project here:",
    "projets-desc4":"\"Le Cube\" system: a hand-language communication device whose word production can be programmed.",
    "projets-desc5":"Languages developed during my internship: Morse code without time consideration and analog coding similar to push-button phones.",
    "projets-desc6":"\"ScenaBox\" project: a work device in various cognitive fields with personalized support through creation and modification of games.",
    "projets-desc7":"Complete system improvement to make it more compact, more durable, more aesthetic, and more powerful. Full redesign of the electronic assembly.",
    "videos-title1":"Student project: dashboard control via CAN bus.",
    "videos-title2":"Personal project: synchronizing an LED strip according to a screen display.",
    "videos-title3":"Personal project: control of Philips Hue-type lamps.",
    "contact-title":"Contact Me",
    "contact-phone":"By phone: +33 7 82 64 55 52.",
    "contact-mail":"By email: ",
    "perso-title1":"Personal",
    "perso-title2":"Education",
    "perso-desc1":"21 years old.",
    "perso-desc2":"Lives in Rosières-près-Troyes.",
    "perso-desc3":"Hobbies: electronics, technology, motorsports.",
    "perso-desc4":"General baccalaureate, specialties: Engineering Sciences, Mathematics, option Advanced Mathematics. Obtained in July 2022 with honors.",
    "perso-desc5":"BUT in Electrical Engineering and Industrial Computing, specialty Electronics and Embedded Systems at IUT de l'Aisne, Soissons-Cuffies. Obtained in July 2025.",
    "perso-desc6":"Master in Complex Systems Engineering, ongoing since September 2025.",
    "theme-toggle": "Change Theme"
}