{
    "title": "Théo Dhuiege - Ma page",
    "header-title": "Bienvenue sur la page de Théo Dhuiege",
    "tab-home": "Accueil",
    "tab-competences": "Compétences",
    "tab-cv": "CV",
    "tab-projets": "Mes projets",
    "tab-videos": "Vidéos",
    "tab-contact": "Contact",
    "tab-perso": "Perso",
    "home-title": "Accueil",
    "home-desc1": "Etudiant en première année de Master Ingéniérie des Systèmes Complexes",
    "home-desc2": "Je suis passionné par les technologies et j'étudie actuellement dans ce domaine.",
    "home-desc3": "Cette page vous montre mon parcours scolaire et professionnel ainsi que certains de mes projets réalisés dans le cadre de mes études et dans le cadre personnel.",
    "competences-title1":"Compétences en informatique",
    "competences-title2":"Compétences en électronique",
    "competences-title3":"Compétences en automatique et automatisme",
    "competences-title4":"Compétences supplémentaires",
    "competences-desc1":"Langages C, Java, VBA|VBNet et VHDL.",
    "competences-desc2":"Utilisation de divers logiciels de programmation : CCS C, PlatformIO, Visual Studio, PSoC Creator.",
    "competences-desc3":"Développement de projets dans des cartes et microcontrôleurs type Arduino, PIC C et Raspberry Pi.",
    "competences-desc4":"Recherche et développement de schémas électroniques, conception et tests de ces schémas.",
    "competences-desc5":"Utilisation de logiciels d'aide à la conception et à la recherche : MatLab, suite Proteus.",
    "competences-desc6":"Réalisation de systèmes à asservissement avec paramètres de régulation dans des systèmes thermiques, pneumatiques ou encore mécaniques.",
    "competences-desc7":"Programmation d'automates de marques Siemens et Schneider via leur logiciel dédié : TIA Portal et Unity Pro. Programmation en LADDER et en GRAFCET.",
    "competences-desc8":"Programmation sur Microsoft Excel en utilisant le langage VBA.",
    "competences-desc9":"Réflexion sur le projet dans le temps via les outils dédiés tels que la méthode de GANTT.",
    "competences-desc10":"Méthodes de recherche en maintenance : Pareto, PDCA ou encore le diagramme d’Ishikawa.",
    "cv-title":"Historique",
    "cv-desc1":"Septembre 2019 - juillet 2022 : baccalauréat général au lycée Léonard de Vinci à Soissons.",
    "cv-desc2":"Spécialités choisies : mathématiques et sciences de l'Ingénieur",
    "cv-desc3":"Option de terminale : mathématiques expertes.",
    "cv-desc4":"Baccalauréat obtenu en juin 2022 avec mention bien.",
    "cv-desc5":"Septembre 2022 - juillet 2025 : BUT Génie Electrique Informatique Industrielle.",
    "cv-desc6":"Spécialité Electronique et Systèmes Embarqués",
    "cv-desc7":"Avril - juin 2024 : stage dans le cadre de mon BUT.",
    "cv-desc8":"Recherche, développement et présentation lors d'un concours d'un outil de communication par la main.",
    "cv-desc9":"Mars - juin 2025 : stage dans le cadre de mon BUT.",
    "cv-desc10":"Conception, construction et présentation lors d'un concours d'un outil d'apprentissage dans des domaines cognitifs diverses.",
    "projets-title1":"Projet étudiant en informatique.",
    "projets-title2":"Projet de stage de deuxième année.",
    "projets-title3":"Projet de stage de troisième année.",
    "projets-desc1":"Développement d'un gestionnaire de tickets de train via Microsoft Excel et VBA.",
    "projets-desc2":"Fonctionnalités : Gestion de routes, achat de billets, personnalisation du barème tarifaire et consultation de statistiques.",
    "projets-desc3":"Ci-dessous, vous pouvez consulter le manuel de ce projet",
    "projets-desc4":"Système \"Le Cube\" : appareil de communication à langage par la main dont le moyen de production des mots est modifiable par programmation.",
    "projets-desc5":"Langages développés durant mon stage : code morse sans prise en compte du temps et codage analogue aux téléphones à touches.",
    "projets-desc6":"Projet \"ScenaBox\" : appareil de travail dans divers domaines cognitifs, avec accompagnement personnalisé via création et modification de jeux.",
    "projets-desc7":"Amélioration complète du système afin de le rendre plus compacte, plus résistant, plus esthétique et plus puissant. Refonte intégrale du montage électronique.",
    "videos-title1":"Projet étudiant de contrôle d'un tableau de bord via une liaison CAN.",
    "videos-title2":"Projet personnel de synchronisation d'une bande de LED selon un affichage sur un écran.",
    "videos-title3":"Projet personnel de contrôle des lampes de type Philips Hue.",
    "contact-title":"Pour me contacter",
    "contact-phone":"Par téléphone : 07 82 64 55 52.",
    "contact-mail":"Par e-mail : ",
    "perso-title1":"Perso",
    "perso-title2":"Etudes",
    "perso-desc1":"21 ans.",
    "perso-desc2":"Habite à Rosières-près-Troyes.",
    "perso-desc3":"Hobbys : électronique, technologie, sport automobile.",
    "perso-desc4":"Baccalauréat général, spécialités Sciences de l'Ingénieur, Mathématiques, option mathématiques expertes. Obtenu en juillet 2022 mention bien.",
    "perso-desc5":"BUT Génie Electronique et Informatique Industrielle, parcours Electronique et Systèmes Embarqués à l'IUT de l'Aisne, Soissons-Cuffies. Obtenu en juillet 2025.",
    "perso-desc6":"Master Ingéniérie des Systèmes Complexes, en cours depuis septembre 2025.",
    "theme-toggle": "Changer le thème"
}